/*Завдання 3: Сортування вставками (Insertion Sort)
Концепція: Нагадує перемішування колоди карт. Береться один елемент і "вставляється" його на
правильне місце серед уже відсортованих ліворуч від нього.
Опис алгоритму:
1. Починається з другого елемента (вважається, що перший уже "відсортований").
2. Відбувається порівняння поточного елементу із тими, що стоять ліворуч.
3. "Зсуваємо" всі елементи, які більші за поточний, на одну позицію праворуч.
4. Вставляємо поточний елемент на вільне місце, що звільнилося.
Технічне Завдання для реалізації:
• Створити функцію insertionSort(arr).
• Використати цикл while всередині циклу for для зміщення елементів ліворуч.*/

let arr = [5, 3, 8, 4, 2];

function insertionSort(arr) {
  for (let j = 1; j < arr.length; j++) {
    let currentValue = arr[j];

    let k = j - 1;
    while (k >= 0 && currentValue < arr[k]) {
      arr[k + 1] = arr[k];
      k--;
    }
    arr[k + 1] = currentValue;
  }
  return arr;
}

console.log(insertionSort(arr));
