/*Завдання 1: Сортування бульбашкою (Bubble Sort)
Концепція: Найпростіший, але найменш ефективний алгоритм. Його суть у тому, що найбільші
елементи «спливають» у кінець масиву, як бульбашки повітря у воді.
Опис алгоритму:
1. Порівнюємо два сусідні елементи: a[i] та a[i + 1].
2. Якщо лівий елемент більший за правий — міняємо їх місцями.
3. Повторюємо це для кожної пари сусідів до кінця масиву.
4. Після одного повного проходу найбільше число гарантовано опиниться в кінці.
5. Повторюємо прохід для частини масиву, що залишилася (без останнього елемента).
Технічне Завдання для реалізації:
• Створити функцію bubbleSort(arr).
• Використати вкладені цикли for.
• Додаткове завдання*: Додати оптимізацію (переривання циклу, якщо за цілий прохід не
було зроблено жодної заміни).*/

let arr = [5, 3, 8, 4, 2];

function bubbleSort(arr) {
  for (let j = 0; j < arr.length; j++) {
    let swapped = false;

    for (let i = 0; i < arr.length - 1 - j; i++) {
      if (arr[i] > arr[i + 1]) {
        let temporaryItem = arr[i];
        arr[i] = arr[i + 1];
        arr[i + 1] = temporaryItem;
        swapped = true;
      }
    }
    if (!swapped) {
      break;
    }
  }

  return arr;
}

console.log(bubbleSort(arr));
