/*Завдання 2: Сортування вибором (Selection Sort)
Концепція: Щоразу шукається найменший елемент у невідсортованій частині масиву і ставиться
його на початок.
Опис алгоритму:
1. Припускається, що перший елемент — мінімальний.
2. Відбувається прохід по решті масиву, щоб знайти фактичний мінімум.
3. Якщо знайдено число, менше за поточний мінімум — запам'ятовується його індекс.
4. Після завершення проходу міняються місцями знайдений мінімум з елементом на першій
позиції.
5. Відбувається повторення кроків 1-4 для наступної позиції (другої, третьої і т.д.).
Технічні Завдання для реалізації:
• Створити функцію selectionSort(arr).
• Ввести змінну minIndex для відстеження найменшого значення під час кожної ітерації.*/

let arr = [5, 3, 8, 4, 2];

function selectionSort(arr) {
  for (let j = 0; j < arr.length; j++) {
    let minIndex = j;

    for (let i = j + 1; i < arr.length; i++) {
      if (arr[i] < arr[minIndex]) {
        minIndex = i;
      }
    }
    if (minIndex !== j) {
      let temporaryItem = arr[j];
      arr[j] = arr[minIndex];
      arr[minIndex] = temporaryItem;
    }
  }
  return arr;
}

console.log(selectionSort(arr));
